/*
Створити функцію компонента для айтема
лі з текстом + з кнопкою

За натискненням на кнопку лі зникає з екрану

1. Потрібно зробити функціональну компоненту
2. Винисти в цю функціональну конпоненту лі
3. Переписати логіку відмалювання лі так, 
що данні тепер будуть спускатись від батька через пропси
4. Зробіть колбек в батьківського елемента, який має отримати id
на вхід та видалити зі стейта елемент з таким id 
5. В component Todoitem зробити виклик колбека і передати йому id
(за натиснення на кнопку)
*/
import React from "react";

function TodoItem(props) {
  const { id, text, onDelete } = props;

  return (
    <li>
      {text} <button onClick={() => onDelete(id)}>Delete</button>
    </li>
  );
}

export default TodoItem;
